
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	СправочникиКоллекция = Метаданные.Справочники;
	ДокументыКоллекция = Метаданные.Документы;
	
	//Справочники
	Если Форма.ИмяФормы = СправочникиКоллекция.ДоговорыКонтрагентов.ОсновнаяФормаОбъекта.ПолноеИмя() Тогда
		ДоговорыКонтрагентов_ПриСозданииНаСервере(Форма);
	//Документы
	ИначеЕсли Форма.ИмяФормы = ДокументыКоллекция.РеализацияТоваровУслуг.ОсновнаяФормаОбъекта.ПолноеИмя() Тогда
		РеализацияТоваровУслуг_ПриСозданииНаСервере(Форма);
	КонецЕсли;

КонецПроцедуры


#Область ПриСозданииНаСервере

#Область Справочники

Процедура ДоговорыКонтрагентов_ПриСозданииНаСервере(Форма)
	
	Элементы = Форма.Элементы;
	
	Если Элементы.Найти("ВКМ_ДобавляемыеЭлементыФормы") = Неопределено Тогда
		ВКМ_ДобавляемыеЭлементыФормы = Элементы.Добавить("ВКМ_ДобавляемыеЭлементыФормы", Тип("ГруппаФормы"), Форма);
		ВКМ_ДобавляемыеЭлементыФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ВКМ_ДобавляемыеЭлементыФормы.ОтображатьЗаголовок = Ложь;	
		ВКМ_ДобавляемыеЭлементыФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	КонецЕсли;
	
	Если Элементы.Найти("ГруппаПериод") = Неопределено Тогда
		ГруппаПериод = Элементы.Добавить("ГруппаПериод", Тип("ГруппаФормы"), ВКМ_ДобавляемыеЭлементыФормы);
		ГруппаПериод.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаПериод.ОтображатьЗаголовок = Ложь;	
		ГруппаПериод.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	КонецЕсли;
	
	Если Элементы.Найти("ДатаНачалаДоговора") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("ДатаНачалаДоговора", Тип("ПолеФормы"), ГруппаПериод);
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";	
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Дата начала договора";
	КонецЕсли;
	
	Если Элементы.Найти("ДатаОкончанияДоговора") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("ДатаОкончанияДоговора", Тип("ПолеФормы"), ГруппаПериод);
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";	
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Дата окончания договора";
	КонецЕсли;
	
	Если Элементы.Найти("СуммаЕжемесячнойАбонентскойПлаты") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("СуммаЕжемесячнойАбонентскойПлаты", Тип("ПолеФормы"), ВКМ_ДобавляемыеЭлементыФормы);
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СуммаЕжемесячнойАбонентскойПлаты";	
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Сумма абонентской платы";
	КонецЕсли;
		
	Если Элементы.Найти("СтоимостьЧасаРаботы") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"), ВКМ_ДобавляемыеЭлементыФормы);
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботыСпециалиста";	
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Стоимость часа работы";
	КонецЕсли;
	
	Элементы.ВидДоговора.УстановитьДействие("ПриИзменении", "ВКМ_ВидДоговораПриИзменении")
	
КонецПроцедуры

#КонецОбласти

#Область Документы

Процедура РеализацияТоваровУслуг_ПриСозданииНаСервере(Форма)
	
	Элементы = Форма.Элементы;
	
	НоваяКоманда = Форма.Команды.Добавить("Заполнить");
	НоваяКоманда.Действие = "ВыполнитьЗаполнить";
	НоваяКоманда.Заголовок = "Заполнить";
	
	Кнопка = Элементы.Добавить("КнопкаЗаполнить", Тип("КнопкаФормы"), Элементы.ФормаКоманднаяПанель);
	Кнопка.ИмяКоманды = "Заполнить";
	 
КонецПроцедуры

#КонецОбласти

#КонецОбласти