#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СоздатьДокументы(Знач Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ДоговорыКонтрагентов.Владелец КАК Владелец,
		|	ДоговорыКонтрагентов.Организация КАК Организация,
		|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.Владелец) КАК КонтрагентПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДоговорыКонтрагентов.Ссылка) КАК ДоговорПредставление
		|ПОМЕСТИТЬ ВТДоговора
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
		|	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ
		|	И ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора <= &ДатаОкончанияПериода
		|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора >= &ДатаНачалаПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Документ,
		|	РеализацияТоваровУслуг.Ссылка.Договор КАК Договор
		|ПОМЕСТИТЬ ВТДокументы
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Проведен
		|	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачалаПериода И &ДатаОкончанияПериода
		|	И РеализацияТоваровУслуг.Договор В
		|			(ВЫБРАТЬ
		|				Договора.Договор КАК Договор
		|			ИЗ
		|				ВТДоговора КАК Договора)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДоговора.Договор КАК Договор,
		|	ЕСТЬNULL(ВТДокументы.Документ, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК Документ,
		|	&ДатаОкончанияПериода КАК Дата,
		|	ВТДоговора.Владелец КАК Контрагент,
		|	ВТДоговора.Организация КАК Организация,
		|	ВТДоговора.ДоговорПредставление КАК ДоговорПредставление,
		|	ВТДоговора.КонтрагентПредставление КАК КонтрагентПредставление
		|ИЗ
		|	ВТДоговора КАК ВТДоговора
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументы КАК ВТДокументы
		|		ПО ВТДоговора.Договор = ВТДокументы.Договор
		|ГДЕ
		|	ЕСТЬNULL(ВТДокументы.Документ, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) = ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ДатаНачалаПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончанияПериода", Период.ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокДоговоровИРеализаций = Новый ТаблицаЗначений;
	СписокДоговоровИРеализаций.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	СписокДоговоровИРеализаций.Колонки.Добавить("Реализация", Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг"));	
	
	Пока Выборка.Следующий() Цикл                            
		
		ДокументРеализации = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		ДокументРеализации.Заполнить(Выборка);
		ДокументРеализации.ВКМ_ВыполнитьАвтозаполнение();
			
		Если ДокументРеализации.СуммаДокумента = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			 	
			ДокументРеализации.Записать(РежимЗаписиДокумента.Проведение); 

			Строка = СписокДоговоровИРеализаций.Добавить();
			Строка.Договор = Выборка.Договор;
			Строка.Реализация = ДокументРеализации.Ссылка;
			
		Исключение  

			ЗаписьЖурналаРегистрации("ОшибкаОперации", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
			
		КонецПопытки;
		
		
	КонецЦикла;
	
	Результат = Новый Структура();
	Результат.Вставить("МассивДоговоровИРеализаций", ОбщегоНазначения.ТаблицаЗначенийВМассив(СписокДоговоровИРеализаций));
	
	Возврат Результат;
	
КонецФункции 

#КонецОбласти

#КонецЕсли