#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусковОтпуска.Сотрудник КАК Сотрудник,
		|	СУММА(РАЗНОСТЬДАТ(ВКМ_ГрафикОтпусковОтпуска.ДатаНачала, ВКМ_ГрафикОтпусковОтпуска.ДатаОкончания, ДЕНЬ) + 1) КАК
		|		ОбщаяПродолжительностьОтпуска
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков.Отпуска КАК ВКМ_ГрафикОтпусковОтпуска
		|ГДЕ
		|	ВКМ_ГрафикОтпусковОтпуска.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ГрафикОтпусковОтпуска.Сотрудник";
	

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();	
	
	Движения.ВКМ_СведенияОбОтпусках.Записывать = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_СведенияОбОтпусках.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Год = ГодОтпусков;
		Движение.ПродолжительностьВДнях = Выборка.ОбщаяПродолжительностьОтпуска;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли