
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Начисления.Количество() = 0 И ДополнительныеНачисления.Количество() = 0 Тогда
		ТекстСообщения = "Табличные части документа не заполнены. Документ не проведен.";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Возврат;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
		
	СформироватьДвиженияПоОсновнымНачислениям(); 
	СформироватьСторноЗаписи();
	СформироватьДвиженияПоПремииПроцентом();
	СформироватьНДФЛ();
	РассчитатьОклады();	
	РассчитатьОтпускныеНачисления();
	РасчитатьНДФЛ(); 
	СформироватьВзаиморасчетыССотрудниками(); 
	СформироватьДвиженияВыполненныеСотрудникомРаботы(Отказ);

КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Процедура СформироватьДвиженияПоОсновнымНачислениям() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_НачислениеЗарплатыНачисления.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТ_Сотрудники
		|ИЗ
		|	Документ.ВКМ_НачислениеЗарплаты.Начисления КАК ВКМ_НачислениеЗарплатыНачисления
		|ГДЕ
		|	ВКМ_НачислениеЗарплатыНачисления.Ссылка = &Ссылка
		|	И ВКМ_НачислениеЗарплатыНачисления.ВидРасчета = &Оклад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Сотрудники.Сотрудник КАК Сотрудник,
		|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад, 0) КАК Оклад
		|ПОМЕСТИТЬ ВТ_Оклады
		|ИЗ
		|	ВТ_Сотрудники КАК ВТ_Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&ДатаДокумента, Сотрудник В
		|			(ВЫБРАТЬ
		|				ВКМ_НачислениеЗарплатыНачисления.Сотрудник
		|			ИЗ
		|				Документ.ВКМ_НачислениеЗарплаты.Начисления КАК ВКМ_НачислениеЗарплатыНачисления
		|			ГДЕ
		|				ВКМ_НачислениеЗарплатыНачисления.Ссылка = &Ссылка
		|				И ВКМ_НачислениеЗарплатыНачисления.ВидРасчета = &Оклад)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|		ПО ВТ_Сотрудники.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_НачислениеЗарплатыНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_НачислениеЗарплатыНачисления.ВидРасчета КАК ВидРасчета,
		|	ВКМ_НачислениеЗарплатыНачисления.ДатаНачала КАК ПериодДействияНачало,
		|	ВКМ_НачислениеЗарплатыНачисления.ДатаОкончания КАК ПериодДействияКонец,
		|	ВКМ_НачислениеЗарплатыНачисления.ГрафикРаботы КАК ГрафикРаботы,
		|	ВЫБОР
		|		КОГДА ВКМ_НачислениеЗарплатыНачисления.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск)
		|			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВКМ_НачислениеЗарплатыНачисления.ДатаНачала, МЕСЯЦ, -12), МЕСЯЦ)
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК БазовыйПериодНачало,
		|	ВЫБОР
		|		КОГДА ВКМ_НачислениеЗарплатыНачисления.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск)
		|			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ВКМ_НачислениеЗарплатыНачисления.ДатаНачала, МЕСЯЦ, -1), МЕСЯЦ)
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК БазовыйПериодКонец,
		|	ВКМ_НачислениеЗарплатыНачисления.Ссылка.Дата КАК ПериодРегистрации,
		|	ЕСТЬNULL(ВТ_Оклады.Оклад, 0) КАК Показатель
		|ИЗ
		|	Документ.ВКМ_НачислениеЗарплаты.Начисления КАК ВКМ_НачислениеЗарплатыНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Оклады КАК ВТ_Оклады
		|		ПО ВКМ_НачислениеЗарплатыНачисления.Сотрудник = ВТ_Оклады.Сотрудник
		|ГДЕ
		|	ВКМ_НачислениеЗарплатыНачисления.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Оклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("ДатаДокумента",(Дата));
	
	Выборка = Запрос.Выполнить().Выбрать();

	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина; 
		
	Пока Выборка.Следующий() Цикл 
		
		Если Выборка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад 
			И Выборка.Показатель = 0 Тогда
			
			Продолжить;
	
		КонецЕсли; 
		
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить(); 
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		
	КонецЦикла;   
			
	Движения.ВКМ_ОсновныеНачисления.Записать();
		
КонецПроцедуры  

Процедура СформироватьСторноЗаписи()
      
      СторноЗаписи = Движения.ВКМ_ОсновныеНачисления.ПолучитьДополнение();
      
	  Если Не ЗначениеЗаполнено(СторноЗаписи) Тогда
	      Возврат;
	  КонецЕсли; 
	  
	  Для Каждого Запись Из СторноЗаписи Цикл

	      Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		  
	      ЗаполнитьЗначенияСвойств(Движение, Запись);
	      Движение.Сторно = Истина;
	      Движение.ПериодРегистрации = Дата;
	      Движение.ПериодДействияНачало = Запись.ПериодДействияНачалоСторно;
	      Движение.ПериодДействияКонец = Запись.ПериодДействияКонецСторно;
		        	  
	  КонецЦикла;
	  
	  Движения.ВКМ_ОсновныеНачисления.Записать();
	
КонецПроцедуры

Процедура СформироватьДвиженияПоПремииПроцентом()	                

	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	
	Для Каждого ТекСтрокаДополнительныеНачисления Из ДополнительныеНачисления Цикл

		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПремияФиксированная;
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = ТекСтрокаДополнительныеНачисления.Сотрудник;
		Движение.Результат = ТекСтрокаДополнительныеНачисления.Сумма;
		
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	
КонецПроцедуры

Процедура СформироватьНДФЛ()
	
	СписокСотрудников = Начисления.Выгрузить(,"Сотрудник"); 
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДополнительныеНачисления,СписокСотрудников); 
	СписокСотрудников.Свернуть("Сотрудник"); 
	
	Движения.ВКМ_Удержания.Записывать = Истина;
	
	Для Каждого Сотрудник Из СписокСотрудников  Цикл
		
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.ПериодРегистрации = Дата;        
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата);
		Движение.Сотрудник = Сотрудник.Сотрудник;
		
	КонецЦикла;
	
	Движения.ВКМ_Удержания.Записать();
	
КонецПроцедуры

Процедура РассчитатьОклады() 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия, 0) КАК Норма,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК Факт
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Регистратор
		|	И ВидРасчета = &ВидРасчета) КАК ВКМ_ОсновныеНачисленияДанныеГрафика";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1];
				
		Если Выборка.Норма <> 0 Тогда
			Движение.Результат = Движение.Показатель * Выборка.Факт / Выборка.Норма;
		КонецЕсли;	
		
		Движение.ОтработаноДней = Выборка.Факт;
		
		Если Движение.Сторно Тогда 
			
			Движение.Результат = -Движение.Результат;
			Движение.ОтработаноДней = -Движение.ОтработаноДней;
			
		КонецЕсли;
		
	КонецЦикла; 
		
	Движения.ВКМ_ОсновныеНачисления.Записать(,Истина);
	
КонецПроцедуры

Процедура РассчитатьОтпускныеНачисления()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК ЗначениеФактическийПериодДействия,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.РезультатБаза, 0) + ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.РезультатБаза, 0) КАК Поле1,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ОтработаноДнейБаза, 0) КАК ОтработаноДнейБаза
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(&Измерения, &Измерения, , Регистратор = &Регистратор И ВидРасчета = &Отпуск) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления
		|		ПО (ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.НомерСтроки)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ДополнительныеНачисления(&Измерения, &Измерения, , Регистратор = &Регистратор И ВидРасчета = &Отпуск) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления
		|		ПО (ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.НомерСтроки)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Регистратор И ВидРасчета = &Отпуск) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
		|		ПО (ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки)
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.Регистратор = &Регистратор
		|	И ВКМ_ОсновныеНачисления.ВидРасчета = &Отпуск";
	
	Запрос.УстановитьПараметр("Отпуск", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
	Измерения = Новый Массив; 
	Измерения.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("Измерения", Измерения);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1];
		
		Движение.Показатель =  Выборка.РезультатБаза;
	
		Если Выборка.ОтработаноДнейБаза <> 0 Тогда
			Движение.Результат = Выборка.РезультатБаза * Выборка.Факт / Выборка.ОтработаноДнейБаза ;
		КонецЕсли;		
		Движение.ОтработаноДней = Выборка.Факт;
		
		Если Движение.Сторно Тогда 
			
			Движение.Результат = -Движение.Результат; 
			Движение.ОтработаноДней = -Выборка.Факт;
		КонецЕсли;
			
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать(,Истина);
	
КонецПроцедуры

Процедура РасчитатьНДФЛ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЕСТЬNULL(ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.НомерСтроки, 0) КАК НомерСтроки,
			|	ЕСТЬNULL(ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.РезультатБаза, 0) КАК РезультатБаза
			|ПОМЕСТИТЬ ВТОсновные
			|ИЗ
			|	РегистрРасчета.ВКМ_Удержания.БазаВКМ_ОсновныеНачисления(
			|			&Измерения,
			|			&Измерения,
			|			&Разрезы,
			|			Регистратор = &Регистратор
			|				И ВидРасчета = &НДФЛ) КАК ВКМ_УдержанияБазаВКМ_ОсновныеНачисления
			|ГДЕ
			|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.Регистратор = ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.РегистраторРазрез
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЕСТЬNULL(ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.НомерСтроки, 0) КАК НомерСтроки,
			|	ЕСТЬNULL(ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.РезультатБаза, 0) КАК РезультатБаза
			|ПОМЕСТИТЬ ВТДополнительно
			|ИЗ
			|	РегистрРасчета.ВКМ_Удержания.БазаВКМ_ДополнительныеНачисления(
			|			&Измерения,
			|			&Измерения,
			|			&Разрезы,
			|			Регистратор = &Регистратор
			|				И ВидРасчета = &НДФЛ) КАК ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления
			|ГДЕ
			|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.Регистратор = ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.РегистраторРазрез
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВКМ_Удержания.НомерСтроки КАК НомерСтроки,
			|	ЕСТЬNULL(ВТОсновные.РезультатБаза, 0) + ЕСТЬNULL(ВТДополнительно.РезультатБаза, 0) КАК БазаНДФЛ
			|ИЗ
			|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОсновные КАК ВТОсновные
			|		ПО ВКМ_Удержания.НомерСтроки = ВТОсновные.НомерСтроки
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДополнительно КАК ВТДополнительно
			|		ПО ВКМ_Удержания.НомерСтроки = ВТДополнительно.НомерСтроки
			|ГДЕ
			|	ВКМ_Удержания.Регистратор = &Регистратор
			|	И ВКМ_Удержания.ВидРасчета = &НДФЛ"; 
	
	
	Запрос.УстановитьПараметр("НДФЛ", ПланыВидовРасчета.ВКМ_Удержания.НДФЛ);   
	Запрос.УстановитьПараметр("Регистратор", Ссылка);

	Измерения = Новый Массив; 
	Измерения.Добавить("Сотрудник");                                 
	
	Разрезы = Новый Массив; 
	Разрезы.Добавить("Регистратор");

	Запрос.УстановитьПараметр("Разрезы", Разрезы);
	Запрос.УстановитьПараметр("Измерения", Измерения);
	
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_Удержания[Выборка.НомерСтроки - 1];
		Движение.КВычету = Выборка.БазаНДФЛ * 13 / 100;
		
	КонецЦикла;	

	Движения.ВКМ_Удержания.Записать(, Истина);
	
	
КонецПроцедуры

Процедура СформироватьВзаиморасчетыССотрудниками()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"   ВЫБРАТЬ
		|			ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|			ЕСТЬNULL(ВКМ_ОсновныеНачисления.Результат, 0) КАК Сумма
		|		ПОМЕСТИТЬ ВТ_Результаты
		|		ИЗ
		|			РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|		ГДЕ
		|			ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ВКМ_ДополнительныеНачисления.Сотрудник,
		|			ЕСТЬNULL(ВКМ_ДополнительныеНачисления.Результат, 0)
		|		ИЗ
		|			РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|		ГДЕ
		|			ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ВКМ_Удержания.Сотрудник,
		|			-ЕСТЬNULL(ВКМ_Удержания.КВычету, 0)
		|		ИЗ
		|			РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|		ГДЕ
		|			ВКМ_Удержания.Регистратор = &Ссылка
		|		;
		|		
		|		////////////////////////////////////////////////////////////////////////////////
		|		ВЫБРАТЬ
		|			ВТ_Результаты.Сотрудник КАК Сотрудник,
		|			СУММА(ВТ_Результаты.Сумма) КАК Сумма
		|		ИЗ
		|			ВТ_Результаты КАК ВТ_Результаты
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВТ_Результаты.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Сумма = Выборка.Сумма;
	
	КонецЦикла;
	
КонецПроцедуры 

Процедура СформироватьДвиженияВыполненныеСотрудникомРаботы(Отказ)

	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записать();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ДополнительныеНачисления;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сотрудник", "Сотрудник");
	
	Попытка
		Блокировка.Заблокировать();	
	Исключение
		ОбщегоНазначения.СообщитьПользователю("Ошибка блокировки данных. Документ не проведен.",,,,Отказ);
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	BKM_НачислениеЗарплатыДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|	СУММА(BKM_НачислениеЗарплатыДополнительныеНачисления.Сумма) КАК СуммаНачисления,
		|	СУММА(BKM_НачислениеЗарплатыДополнительныеНачисления.Часы) КАК НачисленоЧасов
		|ПОМЕСТИТЬ ВТ_Сотрудник
		|ИЗ
		|	Документ.ВКМ_НачислениеЗарплаты.ДополнительныеНачисления КАК BKM_НачислениеЗарплатыДополнительныеНачисления
		|ГДЕ
		|	BKM_НачислениеЗарплатыДополнительныеНачисления.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	BKM_НачислениеЗарплатыДополнительныеНачисления.Сотрудник
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Сотрудник.Сотрудник КАК Сотрудник,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТ_Сотрудник.Сотрудник) КАК ПредставлениеСотрудник,
		|	ВТ_Сотрудник.СуммаНачисления КАК СуммаКОплате,
		|	ВТ_Сотрудник.НачисленоЧасов КАК ЧасовКОплате,
		|	ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОстатки.СуммаОстаток, 0) КАК СуммаКОплатеОстаток,
		|	ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОстатки.ЧасыОстаток, 0) КАК ЧасовКОплатеОстаток
		|ИЗ
		|	ВТ_Сотрудник КАК ВТ_Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Остатки(
		|				&МоментВремени,
		|				Сотрудник В
		|					(ВЫБРАТЬ
		|						ВТ_Сотрудник.Сотрудник КАК Сотрудник
		|					ИЗ 
		|						ВТ_Сотрудник КАК ВТ_Сотрудник)) КАК ВКМ_ВыполненныеСотрудникомРаботыОстатки
		|		ПО ВТ_Сотрудник.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОстатки.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	Пока  Выборка.Следующий() Цикл
		
		Если Выборка.СуммаКОплате > Выборка.СуммаКОплатеОстаток Тогда
			
			ТекстСообщения = СтрШаблон("Документ не проведен. Для сотрудника %1 сумма начисления (%2) больше чем сумма за выполненные работы (%3)",
			Выборка.ПредставлениеСотрудник,Выборка.СуммаКОплате, Выборка.СуммаКОплатеОстаток);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ); 
			
		КонецЕсли;
		
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Сумма = Выборка.СуммаКОплате;
		
		Если  Выборка.СуммаКОплате =  Выборка.СуммаКОплатеОстаток Тогда
			Движение.Часы = Выборка.ЧасовКОплатеОстаток;
		Иначе				 
			Движение.Часы = Выборка.ЧасовКОплате;
		Конецесли;
				
	КонецЦикла;
		
КонецПроцедуры


#КонецОбласти

#КонецЕсли