#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВКМ_Интерфейсы.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	ВКМ_УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_ВидДоговораПриИзменении(Элемент)
	ВКМ_УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаКлиентеНаСервереБезКонтекста
Процедура ВКМ_УстановитьВидимостьЭлементовФормы(Форма)
	Форма.Элементы.ВКМ_ДобавляемыеЭлементыФормы.Видимость = ?(Форма.Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание"), Истина, Ложь);
КонецПроцедуры

#КонецОбласти

