
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
	Если Не ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда 
		ВКМ_ДатаНачалаДействияДоговора = Дата(1,1,1);
		ВКМ_ДатаОкончанияДействияДоговора = Дата(1,1,1);
		ВКМ_СтоимостьЧасаРаботыСпециалиста = 0;
		ВКМ_СуммаЕжемесячнойАбонентскойПлаты = 0;
	ИначеЕсли ВКМ_ДатаОкончанияДействияДоговора < ВКМ_ДатаНачалаДействияДоговора Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			Нстр("ru = ""Дата окончания договора должна быть больше даты начала"""), , "ВКМ_ДатаОкончанияДействияДоговора", 
			"Объект", Отказ);
	КонецЕсли;
	
КонецПроцедуры
